In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/lidiv/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [5]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/bookscores"
engine = create_engine(connection)

In [6]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

Database created!

In [7]:
df = pd.read_csv("C:/Users/lidiv/core/book core/bookcoreupdate/data (3).csv")
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [8]:
# Use the .loc method to select the desired columns as a list
columns_to_select = ['First Name', 'Last Name', 'Email']
df_user = df.loc[:, columns_to_select]

In [9]:
df_user.to_sql('user', engine, if_exists = 'replace')

7

In [10]:
q = """SELECT * FROM user LIMIT 5;"""
pd.read_sql(q, engine)

   index First Name Last Name            Email
0      0       John       Doe     JD@books.com
1      1       John       Doe     JD@books.com
2      2       John       Doe     JD@books.com
3      3      Robin     Smith  Robin@books.com
4      4     Robin      Smith  Robin@books.com

In [11]:
# Use the .loc method to select the desired columns as a list
columns_to_select2 = ['Book Title']
df_book = df.loc[:, columns_to_select2]

In [12]:
df_book.to_sql('book',engine, if_exists = 'replace')

7

In [13]:
q = """SELECT * FROM book LIMIT 5;"""
pd.read_sql(q, engine)

   index            Book Title
0      0           The Shining
1      1                    It
2      2      The Great Gatsby
3      3  The Call of the Wild
4      4   Pride and Prejudice

In [14]:
# Use the .loc method to select the desired columns as a list
columns_to_select2 = ['Book Author']
df_author = df.loc[:, columns_to_select2]

In [15]:
df_author.to_sql('author', engine, if_exists = 'replace')

7

In [16]:
q = """SELECT * FROM author LIMIT 5;"""
pd.read_sql(q, engine)

   index          Book Author
0      0         Stephen King
1      1         Stephen King
2      2  F. Scott Fitzgerald
3      3          Jack London
4      4          Jane Austen

In [17]:
df['favorite_book'] = ''

In [18]:
# Use the .loc method to select the desired columns as a list
columns_to_select3 = ['favorite_book']
df_favorite = df.loc[:, columns_to_select3]

In [19]:
df_favorite.to_sql('favorite', engine, if_exists = 'replace')

7

In [20]:
q = """SELECT * FROM favorite LIMIT 5;"""
pd.read_sql(q, engine)

   index favorite_book
0      0
1      1
2      2
3      3
4      4

In [21]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_bookscores
0               author
1                 book
2             favorite
3                 user

In [25]:
# Define your SQL query
sql_query = """
SELECT book.`Book Title`, favorite.`user_id`
FROM book
JOIN favorite ON book.`index` = favorite.`book_index`
WHERE favorite.`user_id` = (
    SELECT `user`.`id`
    FROM `user`
    WHERE `user`.`last_name` = "Doe" AND `user`.`first_name` = "John"
);
"""